static/presentations/2020-03-11/index.org
#+TITLE: Snakemake Workshop
#+AUTHOR: Edmund Miller & Suhana Bedi
#+REVEAL_THEME: white
#+OPTIONS: reveal_title_slide:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_HLEVEL: 2
* Snakemake
* Setting up
** Download Vscode
*** Extensions
- [[https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-ssh][Remote extension]]
On Remote:
- [[https://marketplace.visualstudio.com/items?itemName=alping.vscode-snakemake][Snakemake extension]]
** Logging into promoter
*** Using VSCode Remote extension :suhana:
NOTE: YOU MUST BE ON ~COMETNET~
#+BEGIN_SRC shell
test@promoter
test123
#+END_SRC
** Creating a new workflow with ~cookiecutter~
*** Open a terminal
- ~Ctrl + Shift + `~
- Use <your-name> for ~repo_name~
#+BEGIN_SRC shell
cookiecutter gl:functional-genomics/cookiecutter-snakemake-workflow
cd <your_name>
make install
#+END_SRC
*** Running ~snakemake~ for the first time
#+BEGIN_SRC shell
make dry
# Equivalent to
poetry run snakemake -n --use-conda --use-singularity -j 4 --report report.html
#+END_SRC
- Right click on ~report.html~ and download it locally
- Open the report in a browser locally
* Writing a workflow
** Step 0: Download the data
*** Open ~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule bwa_map:
    output:
        "data/samples/A.fastq"
    shell:
        """
        wget https://github.com/snakemake/snakemake-tutorial-data/archive/v5.4.5.tar.gz
        tar --wildcards -xf v5.4.5.tar.gz --strip 1 "*/data"
        """
#+END_SRC
** [[https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-1-mapping-reads][Step 1: Mapping reads]]
*** Open ~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule bwa_map:
    input:
        "/home/test/data/genome.fa",
        "/home/test/data/samples/A.fastq"
    output:
        "results/mapped_reads/A.bam"
    conda:
        "./envs/bwa.yml"
    shell:
        "bwa mem {input} | samtools view -Sb - > {output}"
#+END_SRC
*** Open ~workflow/envs/bwa.yml~
#+BEGIN_SRC yaml
channels:
  - bioconda
  - conda-forge
  - defaults
dependencies:
  - bwa ==0.7.17
  - samtools ==1.9
  - picard ==2.20.1
#+END_SRC
*** Run
#+BEGIN_SRC shell
make dry rule=results/mapped_reads/A.bam
make smk rule=results/mapped_reads/A.bam
#+END_SRC
** [[https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-2-generalizing-the-read-mapping-rule][Step 2: Generalizing the read mapping rule]]
*** ~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule bwa_map:
    input:
        "data/genome.fa",
        "data/samples/{sample}.fastq"
    output:
        "results/mapped_reads/{sample}.bam"
    conda:
        "./envs/bwa.yml"
    shell:
        "bwa mem {input} | samtools view -Sb - > {output}"
#+END_SRC
*** Run
#+BEGIN_SRC shell
make smk rule=results/mapped_reads/B.bam
make smk rule="results/mapped_reads/A.bam results/mapped_reads/B.bam"
make smk rule="mapped_reads/{A,B}.bam"
#+END_SRC
** [[https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-3-sorting-read-alignments][Step 3: Sorting read alignments]]
- Note that Snakemake automatically creates missing directories before jobs are executed.
#+BEGIN_SRC snakemake
rule samtools_sort:
    input:
        "results/mapped_reads/{sample}.bam"
    output:
        "results/sorted_reads/{sample}.bam"
    conda:
        "envs/sam.yml"
    shell:
        "samtools sort -T results/sorted_reads/{wildcards.sample} "
        "-O bam {input} > {output}"
#+END_SRC
*** Open ~workflow/envs/bwa.yml~
#+BEGIN_SRC yaml
channels:
  - bioconda
  - conda-forge
  - defaults
dependencies:
  - samtools ==1.9
#+END_SRC
** [[https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-4-indexing-read-alignments-and-visualizing-the-dag-of-jobs][Step 4: Indexing read alignments and visualizing the DAG of jobs]]
*** ~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule samtools_index:
    input:
        "results/sorted_reads/{sample}.bam"
    output:
        "results/sorted_reads/{sample}.bam.bai"
    conda:
        "envs/sam.yml"
    shell:
        "samtools index {input}"
#+END_SRC
*** Update all rule
~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule all:
    input:
        "results/sorted_reads/A.bam.bai",
        "results/sorted_reads/B.bam.bai",
        "results/sorted_reads/C.bam.bai",
#+END_SRC
*** Run
#+BEGIN_SRC shell
make smk
make report
#+END_SRC
- Download ~report.html~
