static/presentations/2020-03-11/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Snakemake Workshop</title>
<meta name="author" content="(Edmund Miller & Suhana Bedi)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/theme/white.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-orgcb9a895">
<h2 id="orgcb9a895">Snakemake</h2>
</section>
</section>
<section>
<section id="slide-org37c39f7">
<h2 id="org37c39f7">Setting up</h2>
<div class="outline-text-2" id="text-org37c39f7">
</div>
</section>
</section>
<section>
<section id="slide-org267d850">
<h3 id="org267d850">Download Vscode</h3>
<div class="outline-text-3" id="text-org267d850">
</div>
</section>
<section id="slide-orgb72079d">
<h4 id="orgb72079d">Extensions</h4>
<ul>
<li><a href="https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-ssh">Remote extension</a></li>

</ul>
<p>
On Remote:
</p>
<ul>
<li><a href="https://marketplace.visualstudio.com/items?itemName=alping.vscode-snakemake">Snakemake extension</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org25bdde9">
<h3 id="org25bdde9">Logging into promoter</h3>
<div class="outline-text-3" id="text-org25bdde9">
</div>
</section>
<section id="slide-orgf03d5c2">
<h4 id="orgf03d5c2">Using VSCode Remote extension&#xa0;&#xa0;&#xa0;<span class="tag"><span class="suhana">suhana</span></span></h4>
<p>
NOTE: YOU MUST BE ON <code>COMETNET</code>
</p>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>test@promoter
test123
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgff2115d">
<h3 id="orgff2115d">Creating a new workflow with <code>cookiecutter</code></h3>
<div class="outline-text-3" id="text-orgff2115d">
</div>
</section>
<section id="slide-orgdaefa2c">
<h4 id="orgdaefa2c">Open a terminal</h4>
<ul>
<li><code>Ctrl + Shift + `</code></li>
<li>Use &lt;your-name&gt; for <code>repo_name</code></li>

</ul>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>cookiecutter gl:functional-genomics/cookiecutter-snakemake-workflow
<span style="color: #ECBE7B;">cd</span> &lt;your_name&gt;
<span style="color: #ECBE7B;">make</span> install
</code></pre>
</div>
</section>
<section id="slide-org0b602e7">
<h4 id="org0b602e7">Running <code>snakemake</code> for the first time</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim><span style="color: #ECBE7B;">make</span> dry
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Equivalent to</span>
poetry run snakemake -n --use-conda --use-singularity -j <span style="color: #da8548; font-weight: bold;">4</span> --report report.html
</code></pre>
</div>
<ul>
<li>Right click on <code>report.html</code> and download it locally</li>
<li>Open the report in a browser locally</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgda4559f">
<h2 id="orgda4559f">Writing a workflow</h2>
<div class="outline-text-2" id="text-orgda4559f">
</div>
</section>
</section>
<section>
<section id="slide-org215810b">
<h3 id="org215810b">Step 0: Download the data</h3>
<div class="outline-text-3" id="text-org215810b">
</div>
</section>
<section id="slide-org3e5cc65">
<h4 id="org3e5cc65">Open <code>workflow/Snakefile</code></h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">bwa_map</span>:
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"data/samples/A.fastq"</span>
    <span style="color: #ECBE7B;">shell</span>:
        <span style="color: #98be65;">"""</span>
<span style="color: #98be65;">        wget https://github.com/snakemake/snakemake-tutorial-data/archive/v5.4.5.tar.gz</span>
<span style="color: #98be65;">        tar --wildcards -xf v5.4.5.tar.gz --strip 1 "*/data"</span>
<span style="color: #98be65;">        """</span>
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org08dea21">
<h3 id="org08dea21"><a href="https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-1-mapping-reads">Step 1: Mapping reads</a></h3>
<div class="outline-text-3" id="text-org08dea21">
</div>
</section>
<section id="slide-org3e4ae30">
<h4 id="org3e4ae30">Open <code>workflow/Snakefile</code></h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">bwa_map</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"/home/test/data/genome.fa"</span>,
        <span style="color: #98be65;">"/home/test/data/samples/A.fastq"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"results/mapped_reads/A.bam"</span>
    <span style="color: #ECBE7B;">conda</span>:
        <span style="color: #98be65;">"./envs/bwa.yml"</span>
    <span style="color: #ECBE7B;">shell</span>:
        <span style="color: #98be65;">"bwa mem {input} | samtools view -Sb - &gt; {output}"</span>
</code></pre>
</div>
</section>
<section id="slide-orgcac754d">
<h4 id="orgcac754d">Open <code>workflow/envs/bwa.yml</code></h4>
<div class="org-src-container">

<pre  class="src src-yaml"><code trim><span style="color: #dcaeea;">channels</span>:
  - bioconda
  - conda-forge
  - defaults
<span style="color: #dcaeea;">dependencies</span>:
  - bwa ==0.7.17
  - samtools ==1.9
  - picard ==2.20.1
</code></pre>
</div>
</section>
<section id="slide-org67b83f3">
<h4 id="org67b83f3">Run</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim><span style="color: #ECBE7B;">make</span> dry <span style="color: #dcaeea;">rule</span>=results/mapped_reads/A.bam
<span style="color: #ECBE7B;">make</span> smk <span style="color: #dcaeea;">rule</span>=results/mapped_reads/A.bam
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org43849d7">
<h3 id="org43849d7"><a href="https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-2-generalizing-the-read-mapping-rule">Step 2: Generalizing the read mapping rule</a></h3>
<div class="outline-text-3" id="text-org43849d7">
</div>
</section>
<section id="slide-org230021c">
<h4 id="org230021c"><code>workflow/Snakefile</code></h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">bwa_map</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"data/genome.fa"</span>,
        <span style="color: #98be65;">"data/samples/{sample}.fastq"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"results/mapped_reads/{sample}.bam"</span>
    <span style="color: #ECBE7B;">conda</span>:
        <span style="color: #98be65;">"./envs/bwa.yml"</span>
    <span style="color: #ECBE7B;">shell</span>:
        <span style="color: #98be65;">"bwa mem {input} | samtools view -Sb - &gt; {output}"</span>
</code></pre>
</div>
</section>
<section id="slide-org168211a">
<h4 id="org168211a">Run</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim><span style="color: #ECBE7B;">make</span> smk <span style="color: #dcaeea;">rule</span>=results/mapped_reads/B.bam
<span style="color: #ECBE7B;">make</span> smk <span style="color: #dcaeea;">rule</span>=<span style="color: #98be65;">"results/mapped_reads/A.bam results/mapped_reads/B.bam"</span>
<span style="color: #ECBE7B;">make</span> smk <span style="color: #dcaeea;">rule</span>=<span style="color: #98be65;">"mapped_reads/{A,B}.bam"</span>
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgb7c7b7f">
<h3 id="orgb7c7b7f"><a href="https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-3-sorting-read-alignments">Step 3: Sorting read alignments</a></h3>
<ul>
<li>Note that Snakemake automatically creates missing directories before jobs are executed.</li>

</ul>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">samtools_sort</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"results/mapped_reads/{sample}.bam"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"results/sorted_reads/{sample}.bam"</span>
    <span style="color: #ECBE7B;">conda</span>:
        <span style="color: #98be65;">"envs/sam.yml"</span>
    <span style="color: #ECBE7B;">shell</span>:
        <span style="color: #98be65;">"samtools sort -T results/sorted_reads/{wildcards.sample} "</span>
        <span style="color: #98be65;">"-O bam {input} &gt; {output}"</span>
</code></pre>
</div>
</section>
<section id="slide-org78a681e">
<h4 id="org78a681e">Open <code>workflow/envs/bwa.yml</code></h4>
<div class="org-src-container">

<pre  class="src src-yaml"><code trim><span style="color: #dcaeea;">channels</span>:
  - bioconda
  - conda-forge
  - defaults
<span style="color: #dcaeea;">dependencies</span>:
  - samtools ==1.9
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgaf7f519">
<h3 id="orgaf7f519"><a href="https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-4-indexing-read-alignments-and-visualizing-the-dag-of-jobs">Step 4: Indexing read alignments and visualizing the DAG of jobs</a></h3>
<div class="outline-text-3" id="text-orgaf7f519">
</div>
</section>
<section id="slide-org2be126c">
<h4 id="org2be126c"><code>workflow/Snakefile</code></h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">samtools_index</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"results/sorted_reads/{sample}.bam"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"results/sorted_reads/{sample}.bam.bai"</span>
    <span style="color: #ECBE7B;">conda</span>:
        <span style="color: #98be65;">"envs/sam.yml"</span>
    <span style="color: #ECBE7B;">shell</span>:
        <span style="color: #98be65;">"samtools index {input}"</span>
</code></pre>
</div>
</section>
<section id="slide-org5749466">
<h4 id="org5749466">Update all rule</h4>
<p>
<code>workflow/Snakefile</code>
</p>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">all</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"results/sorted_reads/A.bam.bai"</span>,
        <span style="color: #98be65;">"results/sorted_reads/B.bam.bai"</span>,
        <span style="color: #98be65;">"results/sorted_reads/C.bam.bai"</span>,
</code></pre>
</div>
</section>
<section id="slide-org9f29803">
<h4 id="org9f29803">Run</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim><span style="color: #ECBE7B;">make</span> smk
<span style="color: #ECBE7B;">make</span> report
</code></pre>
</div>
<ul>
<li>Download <code>report.html</code></li>

</ul>
</section>
</section>
