static/presentations/2020-03-11/index.org
** [[https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-5-calling-genomic-variants][Step 5: Calling genomic variants]]
*** ~expand~
#+BEGIN_SRC snakemake
expand("sorted_reads/{sample}.bam", sample=SAMPLES)
#+END_SRC
Returns:
#+BEGIN_SRC python
["sorted_reads/A.bam", "sorted_reads/B.bam"]
#+END_SRC
*** A more complicated expand
#+BEGIN_SRC snakemake
expand("sorted_reads/{sample}.{replicate}.bam", sample=SAMPLES, replicate=[0, 1])
#+END_SRC
Returns:
#+BEGIN_SRC python
["sorted_reads/A.0.bam", "sorted_reads/A.1.bam", "sorted_reads/B.0.bam", "sorted_reads/B.1.bam"]
#+END_SRC
*** Defining Samples
#+BEGIN_SRC snakemake
SAMPLES = ["A", "B", "C"]
#+END_SRC
*** Rule for calling variants
~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule bcftools_call:
    input:
        fa="data/genome.fa",
        bam=expand("results/sorted_reads/{sample}.bam", sample=SAMPLES),
        bai=expand("results/sorted_reads/{sample}.bam.bai", sample=SAMPLES)
    output:
        "calls/all.vcf"
    conda:
        "../envs/bcf.yml"
    shell:
        "samtools mpileup -g -f {input.fa} {input.bam} | "
        "bcftools call -mv - > {output}"
#+END_SRC
*** ~workflow/envs/bcf.yml~
#+BEGIN_SRC yaml
channels:
  - bioconda
  - conda-forge
  - defaults
dependencies:
  - samtools ==1.9
  - bcftools ==1.9
#+END_SRC
** [[https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-6-using-custom-scripts][Step 6: Using custom scripts]]
*** In ~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule plot_quals:
    input:
        "results/calls/all.vcf"
    output:
        report("results/plots/quals.svg")
    conda:
        "../envs/plot.py"
    script:
        "scripts/plot-quals.py"
#+END_SRC
*** ~workflow/scripts/plot-quals.py~
#+BEGIN_SRC python
import matplotlib
matplotlib.use("Agg")
import matplotlib.pyplot as plt
from pysam import VariantFile

quals = [record.qual for record in VariantFile(snakemake.input[0])]
plt.hist(quals)

plt.savefig(snakemake.output[0])
#+END_SRC 
*** ~workflow/envs/plot.yml~
#+BEGIN_SRC yaml
channels:
  - bioconda
  - conda-forge
  - defaults
dependencies:
  - matplotlib
  - pysam
#+END_SRC
*** Using this with R
- [[https://snakemake.readthedocs.io/en/stable/snakefiles/rules.html#external-scripts][External scripts docs]]
- R, Rmd, or ipynb
#+BEGIN_SRC R
do_something <- function(data_path, out_path, threads, myparam) {
    # R code
}

do_something(snakemake@input[[1]],
             snakemake@output[[1]],
             snakemake@threads,
             snakemake@config[["myparam"]])
#+END_SRC
** [[https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-7-adding-a-target-rule][Step 7: Adding a target rule]]
*** ~workflow/Snakefile~
#+BEGIN_SRC snakemake
rule all:
    input:
        "plots/quals.svg"
#+END_SRC
*** Run it
#+BEGIN_SRC shell
make smk
make report
#+END_SRC
** Taking it to the Cluster
#+BEGIN_SRC shell
ssh eam150030@ganymede
cd scratch
git clone https://gitlab.com/functional-genomics/analysis/snakemake-tutorial.git
cd snakemake-tutorial
# pip install cookiecutter
make profile
module add singlarity/2.4.5
make cluster
#+END_SRC
* Nextflow First Look
** Original Goals from the Snakemake template and cookiecutter
- Easy to reproduce and run on new datasets
- Containerization of software(~conda~)
- Easy to take to the cluster
- A template to quickly start a new workflow
- Coding best practices(CI pipelines, releases)
** [[https://nf-co.re][nf-core pipelines]]
- Now that you've experienced the struggles of creating a pipeline
Running Locally
#+BEGIN_SRC shell
nextflow run nf-core/rnaseq -profile conda \
    --reads '*_R{1,2}.fastq.gz' --genome GRCh37
#+END_SRC
- If this looks scary see [[https://nf-co.re/tools#launch-a-pipeline][nf-core launch]]
** What about this cluster?
#+BEGIN_SRC shell
nextflow run nf-core/rnaseq -profile singularity,utd_ganymede \
    --reads '*_R{1,2}.fastq.gz' --genome GRCh37
#+END_SRC

*Bonus: If you run it on Ganymede it will warn you automagically*
** What about a template?
#+BEGIN_SRC shell
pip install nf-core
nf-core create
#+END_SRC
- https://nf-co.re/tools
