static/presentations/2020-03-11/index.html
<section>
<section id="slide-orgb1e89c2">
<h3 id="orgb1e89c2"><a href="https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-5-calling-genomic-variants">Step 5: Calling genomic variants</a></h3>
<div class="outline-text-3" id="text-orgb1e89c2">
</div>
</section>
<section id="slide-org1cf3cdc">
<h4 id="org1cf3cdc"><code>expand</code></h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #c678dd;">expand</span>(<span style="color: #98be65;">"sorted_reads/{sample}.bam"</span>, sample=SAMPLES)
</code></pre>
</div>
<p>
Returns:
</p>
<div class="org-src-container">

<pre  class="src src-python"><code trim>[<span style="color: #83898d;">"sorted_reads/A.bam"</span>, <span style="color: #83898d;">"sorted_reads/B.bam"</span>]
</code></pre>
</div>
</section>
<section id="slide-org93dfd53">
<h4 id="org93dfd53">A more complicated expand</h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #c678dd;">expand</span>(<span style="color: #98be65;">"sorted_reads/{sample}.{replicate}.bam"</span>, sample=SAMPLES, replicate=[<span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">1</span>])
</code></pre>
</div>
<p>
Returns:
</p>
<div class="org-src-container">

<pre  class="src src-python"><code trim>[<span style="color: #83898d;">"sorted_reads/A.0.bam"</span>, <span style="color: #83898d;">"sorted_reads/A.1.bam"</span>, <span style="color: #83898d;">"sorted_reads/B.0.bam"</span>, <span style="color: #83898d;">"sorted_reads/B.1.bam"</span>]
</code></pre>
</div>
</section>
<section id="slide-orgef4ee2a">
<h4 id="orgef4ee2a">Defining Samples</h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #dcaeea;">SAMPLES</span> = [<span style="color: #98be65;">"A"</span>, <span style="color: #98be65;">"B"</span>, <span style="color: #98be65;">"C"</span>]
</code></pre>
</div>
</section>
<section id="slide-orgd05ef60">
<h4 id="orgd05ef60">Rule for calling variants</h4>
<p>
<code>workflow/Snakefile</code>
</p>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">bcftools_call</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #dcaeea;">fa</span>=<span style="color: #98be65;">"data/genome.fa"</span>,
        <span style="color: #dcaeea;">bam</span>=<span style="color: #c678dd;">expand</span>(<span style="color: #98be65;">"results/sorted_reads/{sample}.bam"</span>, sample=SAMPLES),
        <span style="color: #dcaeea;">bai</span>=<span style="color: #c678dd;">expand</span>(<span style="color: #98be65;">"results/sorted_reads/{sample}.bam.bai"</span>, sample=SAMPLES)
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #98be65;">"calls/all.vcf"</span>
    <span style="color: #ECBE7B;">conda</span>:
        <span style="color: #98be65;">"../envs/bcf.yml"</span>
    <span style="color: #ECBE7B;">shell</span>:
        <span style="color: #98be65;">"samtools mpileup -g -f {input.fa} {input.bam} | "</span>
        <span style="color: #98be65;">"bcftools call -mv - &gt; {output}"</span>
</code></pre>
</div>
</section>
<section id="slide-org82ec070">
<h4 id="org82ec070"><code>workflow/envs/bcf.yml</code></h4>
<div class="org-src-container">

<pre  class="src src-yaml"><code trim><span style="color: #dcaeea;">channels</span>:
  - bioconda
  - conda-forge
  - defaults
<span style="color: #dcaeea;">dependencies</span>:
  - samtools ==1.9
  - bcftools ==1.9
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org084572f">
<h3 id="org084572f"><a href="https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-6-using-custom-scripts">Step 6: Using custom scripts</a></h3>
<div class="outline-text-3" id="text-org084572f">
</div>
</section>
<section id="slide-org06073ea">
<h4 id="org06073ea">In <code>workflow/Snakefile</code></h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">plot_quals</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"results/calls/all.vcf"</span>
    <span style="color: #ECBE7B;">output</span>:
        <span style="color: #c678dd;">report</span>(<span style="color: #98be65;">"results/plots/quals.svg"</span>)
    <span style="color: #ECBE7B;">conda</span>:
        <span style="color: #98be65;">"../envs/plot.py"</span>
    <span style="color: #ECBE7B;">script</span>:
        <span style="color: #98be65;">"scripts/plot-quals.py"</span>
</code></pre>
</div>
</section>
<section id="slide-orgdf71441">
<h4 id="orgdf71441"><code>workflow/scripts/plot-quals.py</code></h4>
<div class="org-src-container">

<pre  class="src src-python"><code trim><span style="color: #51afef;">import</span> matplotlib
matplotlib.use(<span style="color: #98be65;">"Agg"</span>)
<span style="color: #51afef;">import</span> matplotlib.pyplot <span style="color: #51afef;">as</span> plt
<span style="color: #51afef;">from</span> pysam <span style="color: #51afef;">import</span> VariantFile

<span style="color: #dcaeea;">quals</span> = [record.qual <span style="color: #51afef;">for</span> record <span style="color: #51afef;">in</span> VariantFile(snakemake.<span style="color: #c678dd;">input</span>[<span style="color: #da8548; font-weight: bold;">0</span>])]
plt.hist(quals)

plt.savefig(snakemake.output[<span style="color: #da8548; font-weight: bold;">0</span>])
</code></pre>
</div>
</section>
<section id="slide-org2899ec7">
<h4 id="org2899ec7"><code>workflow/envs/plot.yml</code></h4>
<div class="org-src-container">

<pre  class="src src-yaml"><code trim><span style="color: #dcaeea;">channels</span>:
  - bioconda
  - conda-forge
  - defaults
<span style="color: #dcaeea;">dependencies</span>:
  - matplotlib
  - pysam
</code></pre>
</div>
</section>
<section id="slide-org412997a">
<h4 id="org412997a">Using this with R</h4>
<ul>
<li><a href="https://snakemake.readthedocs.io/en/stable/snakefiles/rules.html#external-scripts">External scripts docs</a></li>
<li>R, Rmd, or ipynb</li>

</ul>
<div class="org-src-container">

<pre  class="src src-R"><code trim><span style="color: #c678dd;">do_something</span> <span style="color: #a9a1e1;">&lt;-</span> <span style="color: #51afef;">function</span>(data_path, out_path, threads, myparam) {
    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">R code</span>
}

do_something(snakemake@input[[<span style="color: #da8548; font-weight: bold;">1</span>]],
             snakemake@output[[<span style="color: #da8548; font-weight: bold;">1</span>]],
             snakemake@threads,
             snakemake@config[[<span style="color: #98be65;">"myparam"</span>]])
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org6ee353e">
<h3 id="org6ee353e"><a href="https://snakemake.readthedocs.io/en/stable/tutorial/basics.html#step-7-adding-a-target-rule">Step 7: Adding a target rule</a></h3>
<div class="outline-text-3" id="text-org6ee353e">
</div>
</section>
<section id="slide-org9b922ba">
<h4 id="org9b922ba"><code>workflow/Snakefile</code></h4>
<div class="org-src-container">

<pre  class="src src-snakemake"><code trim><span style="color: #51afef;">rule</span> <span style="color: #c678dd;">all</span>:
    <span style="color: #ECBE7B;">input</span>:
        <span style="color: #98be65;">"plots/quals.svg"</span>
</code></pre>
</div>
</section>
<section id="slide-orgad529ac">
<h4 id="orgad529ac">Run it</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim><span style="color: #ECBE7B;">make</span> smk
<span style="color: #ECBE7B;">make</span> report
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org552de34">
<h3 id="org552de34">Taking it to the Cluster</h3>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>ssh eam150030@ganymede
<span style="color: #ECBE7B;">cd</span> scratch
<span style="color: #ECBE7B;">git</span> clone https://gitlab.com/functional-genomics/analysis/snakemake-tutorial.git
<span style="color: #ECBE7B;">cd</span> snakemake-tutorial
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">pip install cookiecutter</span>
<span style="color: #ECBE7B;">make</span> profile
module add singlarity/2.4.5
<span style="color: #ECBE7B;">make</span> cluster
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgce01f40">
<h2 id="orgce01f40">Nextflow First Look</h2>
<div class="outline-text-2" id="text-orgce01f40">
</div>
</section>
</section>
<section>
<section id="slide-org6b6e360">
<h3 id="org6b6e360">Original Goals from the Snakemake template and cookiecutter</h3>
<ul>
<li>Easy to reproduce and run on new datasets</li>
<li>Containerization of software(<code>conda</code>)</li>
<li>Easy to take to the cluster</li>
<li>A template to quickly start a new workflow</li>
<li>Coding best practices(CI pipelines, releases)</li>

</ul>
</section>
</section>
<section>
<section id="slide-org2788dfd">
<h3 id="org2788dfd"><a href="https://nf-co.re">nf-core pipelines</a></h3>
<ul>
<li>Now that you&rsquo;ve experienced the struggles of creating a pipeline</li>

</ul>
<p>
Running Locally
</p>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>nextflow run nf-core/rnaseq -profile conda <span style="color: #98be65;">\</span>
    --reads <span style="color: #98be65;">'*_R{1,2}.fastq.gz'</span> --genome GRCh37
</code></pre>
</div>
<ul>
<li>If this looks scary see <a href="https://nf-co.re/tools#launch-a-pipeline">nf-core launch</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgdd05f00">
<h3 id="orgdd05f00">What about this cluster?</h3>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>nextflow run nf-core/rnaseq -profile singularity,utd_ganymede <span style="color: #98be65;">\</span>
    --reads <span style="color: #98be65;">'*_R{1,2}.fastq.gz'</span> --genome GRCh37
</code></pre>
</div>

<p>
<b>Bonus: If you run it on Ganymede it will warn you automagically</b>
</p>
</section>
</section>
<section>
<section id="slide-org3f91b98">
<h3 id="org3f91b98">What about a template?</h3>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>pip install nf-core
nf-core create
</code></pre>
</div>
<ul>
<li><a href="https://nf-co.re/tools">https://nf-co.re/tools</a></li>

</ul>
</section>
</section>
